/* Антон Алиев
 * Алгоритмы,  урок 2, задание 2
 * 
 * Реализовать функцию перевода чисел из десятичной системы в двоичную, используя рекурсию.
 */

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static ConsoleIO_Lib.ConsolIO;

namespace Lesson_2_Lib
{
    public class Task2
    {
        public static void Run()
        {
            Console.WriteLine("Задание 2\nРеализовать функцию возведения числа a в степень b:\n" +
                "a) Без рекурсии\nb)Рекурсивно\nc)* Рекурсивно, используя свойство чётности степени");
        }
    }
}
