/* Антон Алиев
 * Алгоритмы,  урок 2, задание 1
 * 
 * Реализовать функцию перевода чисел из десятичной системы в двоичную, используя рекурсию.
 */

using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static ConsoleIO_Lib.ConsolIO;

namespace Lesson_2_Lib
{
    public class Task1
    {
        public static void Run()
        {
            Console.WriteLine("Задание 1\nРеализовать функцию перевода чисел из десятичной системы в двоичную, используя рекурсию.");
        }


    }
}
