/* Антон Алиев
 * Алгоритмы, домашнее задание к уроку 3. 
 * 
 * Задание 2*
 * Реализовать шейкерную сортировку
 */

using Lesson_3_Lib;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace MainMenu
{
    public static class Task2
    {
        static string msg = "Задание 2\nРеализовать шейкерную сортировку.";

        public static void Run()
        {
            Console.Clear();
            Console.WriteLine(msg);
            Console.WriteLine("нажмите любую клавишу...");
            Console.ReadKey(true);

            //ArraySort.ShakerSort

            
            ConsoleIO_Lib.ConsolIO.PauseClear();
        }
    }
}
